{"date":"January 22, 2019","headline":"Columbia tuition rates are among the highest in the country. Is it worth it?","byline":"By <a href=\"https://www.columbiaspectator.com/contributors/Jason-Kao\">Jason Kao</a>","footer":"Produced with <a href=\"https://github.com/spec-journalism/spectate\">Spectate</a> by <a href=\"https://github.com/spec-journalism/\">the Spectator Graphics team</a>.","body":[{"type":"text","value":"Every year, the Department of Education releases university-specific data comparing student debt levels to first-year earnings in an effort to analyze the relative profitability of undergraduate degrees. For the first time, following a 2019 <a href=\"https://www.ed.gov/news/press-releases/secretary-devos-delivers-promise-expand-college-scorecard-provide-meaningful-information-students-education-options-and-outcomes\">executive order</a> from the Donald Trump administration, the data now provides comparisons between each program of study offered by an individual institution."},{"type":"text","value":"With this data, Spectator conducted an analysis of the profitability of undergraduate and certain graduate degrees from Columbia in comparison to those of peer institutions. The data is based on university records of federal financial aid released to the DOE; it measures averages for students who graduated in 2015 and 2016."},{"type":"text","value":"While the debt and earnings levels of students across Columbia are overall line with national averages, Spectator’s analysis notably demonstrates that Columbia’s undergraduate and graduate art degrees are significantly less profitable than those of its peers. Specifically, degree earners in those programs are likely to accumulate much more debt than those in peer institutions despite earning an income that is on average the same. Even within the University, those who earned their degrees in visual arts, dance, theatre arts, and creative writing are the only Columbia alumni that can expect more debt than earnings in their first year after graduation."},{"type":"text","value":"Students in a number of graduate programs in engineering—such as civil engineering and information sciences—are also much more likely to incur debt than students at peer programs, though differences are not nearly as noticeable as those in visual programs."},{"type":"text","value":"In specific areas, degree earners from the University can also expect higher income than earners at peer institutions. Students in Business School programs see significantly higher earnings in their first year after matriculation than students in peer programs at institutions such as the University of Pennsylvania, Harvard University, and the Massachusetts Institute of Technology."},{"type":"subhed","value":"Arts"},{"type":"text","value":"In 2018, 52 out of the 54 visual arts students in the School of the Arts <a href=\"https://www.columbiaspectator.com/news/2018/04/30/with-decrepit-facilities-and-missing-faculty-mfa-visual-arts-students-demand-tuition-refund/\">demanded a full tuition refund</a> for the academic year, citing decrepit facilities as evidence that they did not receive the education they were promised."},{"type":"text","value":"Though no conclusion specific to the faults of Columbia’s program can be drawn from the data, the dissatisfaction of students points to a trend in which master’s students in creative arts fields like film and writing accumulate much more debt at Columbia than at peer institutions, but do not earn significantly more than their peers."},{"type":"graphic","value":{"chart":"scatter","subjects":"M: Film/Video and Photographic Arts; M: Rhetoric and Composition/Writing Studies; M: Drama/Theatre Arts and Stagecraft; M: Visual and Performing Arts, Other; M: Architecture"}},{"type":"text","value":"Master’s students in both the architecture and the rhetoric and composition/writing groupings receive higher incomes and lower accumulations of debt compared to other fields in the arts."},{"type":"graphic","value":{"chart":"bars","subjects":"M: debt; M: earnings","highlights":"Film/Video and Photographic Arts; Drama/Theatre Arts and Stagecraft; Visual and Performing Arts, Other"}},{"type":"text","value":"When comparing the financial well-being of master’s and bachelor’s students, while the former have  increased earnings, the latter take on significantly less debt. In the <a href=\"https://provost.columbia.edu/sites/default/files/content/Institutional%20Research/Statistical%20Abstract/cc_ug_degrees_by_program_of_study.pdf\">2019 class</a>, undergraduates majoring in film, drama, and visual arts made up 3.8 percent of the graduating population."},{"type":"graphic","value":{"chart":"scatter","subjects":"B: Fine and Studio Arts; B: Rhetoric and Composition/Writing Studies; B: Visual and Performing Arts, Other"}},{"type":"text","value":"Undergraduates majoring in visual and performing arts or rhetoric and composition/writing studies are the <b>only majors at Columbia </b>that, on average, accumulate <b>more debt than first-year earnings."},{"type":"text","value":"</b>"},{"type":"subhed","value":"Humanities"},{"type":"text","value":"Both the earnings and debt of humanities students at Columbia are similar to those of students at peer institutions. Across these institutions, humanities majors can expect to earn around $40,000 a year while accumulating $20,000 in debt."},{"type":"text","value":"The data did not include prominent humanities graduate programs at Columbia, such as those in the Graduate School of Arts and Sciences."},{"type":"graphic","value":{"chart":"scatter","subjects":"B: History; B: Anthropology; B: Romance Languages, Literatures, and Linguistics; B: Area Studies; B: English Language and Literature, General"}},{"type":"text","value":"Columbia master’s degree recipients in applied social sciences—such as those offered by the School of International and Public Affairs and the Journalism School—can sometimes <b>earn double the income</b> of bachelor’s degree recipients but incur <b>much more debt</b> in the process."},{"type":"graphic","value":{"chart":"scatter","subjects":"M: International Relations and National Security Studies; M: Communication and Media Studies; M: Journalism; M: Social Work"}},{"type":"subhed","value":"Science and engineering"},{"type":"text","value":"In computer science and engineering fields, master’s degree recipients from theColumbia’s School of Engineering and Applied Science<b> earn marginally more</b> but incur <b>much more debt</b> than bachelor’s degree recipients."},{"type":"subsubhed","value":"Bachelor’s students"},{"type":"graphic","value":{"chart":"scatter","subjects":"B: Computer Science; B: Mechanical Engineering"}},{"type":"subsubhed","value":"Master’s students"},{"type":"graphic","value":{"chart":"scatter","subjects":"M: Computer Science; M: Civil Engineering; M: Computer and Information Sciences, General"}},{"type":"text","value":"Undergraduates studying biological sciences seem to have first-year <b>earnings</b> <b>more akin to their counterparts in the humanities</b> than in engineering."},{"type":"graphic","value":{"chart":"scatter","subjects":"B: Biology, General; B: Neurobiology and Neurosciences"}},{"type":"subhed","value":"Business"},{"type":"text","value":"Business School students have some of the <b>highest first-year earnings</b> and comparable debt to their peers at Ivy Plus institutions<b>.</b>"},{"type":"graphic","value":{"chart":"scatter","subjects":"M: Business Administration, Management and Operations; M: Management Information Systems and Services"}},{"type":"text","value":"<i>Staff writer Jason Kao can be contacted at </i><a href=\"mailto:jason.kao@columbiaspectator.com\"><i>jason.kao@columbiaspectator.com</i></a><i>. Follow him on Twitter </i><a href=\"https://twitter.com/jsonkao\"><i>@jsonkao</i></a><i>."},{"type":"text","value":"</i>"}]}